cfg/InformationRegisters/УдалитьКандидатыНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УдалитьКандидатыНаРаботу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ИспытательныйСрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ИспытательныйСрок</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИспытательнымСроком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезИспытательногоСрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/РезультатИспытательногоСрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РезультатИспытательногоСрока</Name>
			<Comment>(Общ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьНамеченныеСобытияПоПерсоналуОрганизаций</xr:Item>
				<xr:Item>InformationRegister.НамеченныеСобытияПоПерсоналу</xr:Item>
				<xr:Item>InformationRegister.СостояниеРаботниковНаИспытательномСроке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыИспытательногоСрока</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьРаботники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияРешения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УдалитьРешенияПоИспытательномуСроку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродлитьСрокДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/InformationRegisters/УдалитьКандидатыНаРаботу/Forms/ФормаСреза/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПередОткрытием" формы.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	// настройка порядка
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.Физлицо.Доступность = Истина;
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.Статус.Доступность = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()

	СтруктураКолонок = Новый Структура();

	// Установить колонки, видимостью которых пользователь управлять не может.
	СтруктураКолонок.Вставить("ФизЛицо");
	СтруктураКолонок.Вставить("Статус");

	// Установить ограничение - изменять видимость колонок для табличной части 
	ОбработкаТабличныхЧастей.УстановитьИзменятьВидимостьКолонокТабЧасти(ЭлементыФормы.РегистрСведенийСписок.Колонки, СтруктураКолонок);

	ЭлементыФормы.ДействияФормы.Кнопки.История.Пометка					= Истина;
	ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.История.Пометка	= Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

Процедура ДействияФормыМенеджерКонтактов(Кнопка)
	
	Обработки.МенеджерКонтактов.ПолучитьФорму().Открыть();
	
КонецПроцедуры

// Процедура открывает форму списка регистра.
Процедура ДействияФормыИстория(Кнопка)
	
	Если Кнопка.Пометка Тогда
		
		ЭлементыФормы.ДействияФормы.Кнопки.История.Пометка					= Ложь;
		ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.История.Пометка	= Ложь;
		
		ЭлементыФормы.РегистрСведенийСписок.ВыбиратьСрез = ИспользованиеСреза.Последние;
		
	Иначе
		
		ЭлементыФормы.ДействияФормы.Кнопки.История.Пометка					= Истина;
		ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.История.Пометка	= Истина;
		
		ЭлементыФормы.РегистрСведенийСписок.ВыбиратьСрез = ИспользованиеСреза.НеИспользовать;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействияФормыОценить(Кнопка)
	Если ЭлементыФормы.РегистрСведенийСписок.ТекущаяСтрока <> Неопределено Тогда
		
		Статус = ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.Статус;
		
		Если Статус = Перечисления.СостоянияКандидатаНаРаботу.ПринятКРассмотрению Тогда
			
			НовыйДокумент = Документы.ОценкаКандидата.СоздатьДокумент();
			ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйДокумент);
			НовыйДокумент.УстановитьНовыйНомер();
			
			НоваяСтрока	= НовыйДокумент.Кандидаты.Добавить();
			НоваяСтрока.ФизЛицо = ЭлементыФормы.РегистрСведенийСписок.ТекущаяСтрока.ФизЛицо;
			НоваяСтрока.ДатаПринятияРешения = РабочаяДата;
			
			НовыйДокумент.ПолучитьФорму().Открыть();
			
		ИначеЕсли Статус = Перечисления.СостоянияКандидатаНаРаботу.ПринятНаРаботу Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ПриемНаРаботуРаботники.ИспытательныйСрок
			                      |ИЗ
			                      |	Документ.ПриемНаРаботу.Работники КАК ПриемНаРаботуРаботники
			                      |
			                      |ГДЕ
			                      |	ПриемНаРаботуРаботники.Ссылка = &Ссылка И
			                      |	ПриемНаРаботуРаботники.Сотрудник.ФизЛицо = &ФизЛицо");
								  
			Запрос.УстановитьПараметр("Ссылка",ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.Регистратор); 
			Запрос.УстановитьПараметр("ФизЛицо",ЭлементыФормы.РегистрСведенийСписок.ТекущаяСтрока.ФизЛицо); 
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() и Выборка.ИспытательныйСрок = Перечисления.ИспытательныйСрок.СИспытательнымСроком Тогда
				
				НовыйДокумент = Документы.РезультатИспытательногоСрока.СоздатьДокумент();
				ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйДокумент);
				НовыйДокумент.УстановитьНовыйНомер();
				
				НоваяСтрока	= НовыйДокумент.Работники.Добавить();
				НоваяСтрока.ФизЛицо = ЭлементыФормы.РегистрСведенийСписок.ТекущаяСтрока.ФизЛицо;
				НоваяСтрока.ДатаПринятияРешения = РабочаяДата;
				НоваяСтрока.Решение = Истина;
				
				НовыйДокумент.ПолучитьФорму().Открыть();
				
			Иначе
				Предупреждение(НСтр("ru='Испытательный срок не назначался!';uk='Випробувальний строк не призначався!'"));
			КонецЕсли;
			
		Иначе
			Предупреждение(НСтр("ru='Решение уже принято!';uk='Рішення вже прийнято!'"));
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ДействияФормыНовыйКандидат(Кнопка)
	Документы.РегистрацияКандидатов.ПолучитьФормуНовогоДокумента().Открыть();
КонецПроцедуры

Процедура ДействияФормыНаписатьПисьмо(Кнопка)
	
	Если ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.ФизЛицо) Тогда
		УправлениеЭлектроннойПочтой.НаписатьПисьмоОбъекту(ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.ФизЛицо, глЗначениеПеременной("глТекущийПользователь"));
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ РегистрСведенийСписок

// Процедура - обработчик события "Выбор" табличного поля.
Процедура РегистрСведенийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если РежимВыбора Тогда
		ВыбранныйНаборДанных = Новый Структура("Физлицо, Статус",Элемент.ТекущаяСтрока.Физлицо,Элемент.ТекущиеДанные.Статус);
		ОповеститьОВыборе(ВыбранныйНаборДанных);
	Иначе
		ВыбраннаяСтрока.Физлицо.ПолучитьФорму().Открыть();
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля.
Процедура РегистрСведенийСписокПередНачаломДобавления(Элемент, Отказ, Копирование)
	Документы.РегистрацияКандидатов.ПолучитьФормуНовогоДокумента().Открыть();
КонецПроцедуры
